#include "event.h"

#include "armfunc.h"
#include "hardware.h"
#include "proc.h"
#include "unit.h"
#include "map.h"
#include "bm.h"
#include "chapter_info.h"

#include "unknown_functions.h"

#include "constants/song.h"
#include "constants/terrain.h"

// = START OF GARBAGE =

#define TALK_RESULT_CANCEL 0
#define TALK_RESULT_YES 1
#define TALK_RESULT_NO 2

#define TALK_FLAG_NOSKIP (1 << 2)
#define TALK_FLAG_NOFAST (1 << 3)
#define TALK_FLAG_OPAQUE (1 << 8)

#define EVENT_FLAG_FOLLOWMOVE 1
#define EVENT_FLAG_TALKSKIPPED 2
#define EVENT_FLAG_SKIPPED 4
#define EVENT_FLAG_UNK_5 0x20
#define EVENT_FLAG_NOSKIPTALK 0x80
#define EVENT_FLAG_SLOWTALK 0x100

#define EVENT_CMDRET_CONTINUE 0
#define EVENT_CMDRET_JUMPED 1
#define EVENT_CMDRET_YIELD 2
#define EVENT_CMDRET_REPEAT 3

void SetTalkFlag(int flag);
Proc * StartTalkMsg(int x, int y, int msg);

void TryMoveUnit(struct Unit * unit, int x, int y, bool closest);

#define BGCHR_TALK 0x80

#define BGPAL_TALK_BACKGROUND 8 // ..15

#define NUM_BACKGROUNDS 0x5B

struct BackgroundInfo
{
    u8 const * img;
    u8 const * tsa;
    u16 const * pal;
};

extern struct BackgroundInfo gBackgroundTable[];

typedef uptr EventScr;

struct EventProc
{
    /* 00 */ PROC_HEADER;
    /* 29 */ ALIGN_PAD(0x29, 0x2C);
    /* 2C */ EventScr const * script_entry;
    /* 30 */ EventScr const * script;
    /* 38 */ EventScr const * script_return;
    /* 34 */ STRUCT_PAD(0x38, 0x40);
    /* 40 */ void (*idle_func)(struct EventProc * proc);
    /* 44 */ struct UnitInfo const * unit_info;
    /* 48 */ i32 talk_auto_msg;
    /* 4C */ i8 background;
    /* 4D */ bool8 unk_4D;
    /* 4E */ u8 unk_4E;
    /* 4F */ u8 map_change_param;
    /* 50 */ u16 sleep_duration;
    /* 52 */ STRUCT_PAD(0x52, 0x55);
    /* 55 */ u8 pid_param; // TODO: what is this exactly?
    /* 56 */ u16 ignore_count;
    /* 58 */ STRUCT_PAD(0x58, 0x5C);
    /* 5C */ u16 iid_param;
    /* 5E */ u16 flags;
};

#define SCR_LO16(script_word) (((script_word) & 0x0000FFFF) >> 0)
#define SCR_HI16(script_word) (((script_word) & 0xFFFF0000) >> 16)

#define SCR_LO16_SIGN(script_word) (SCR_LO16(script_word) & 0x8000 ? -1 : SCR_LO16(script_word))
#define SCR_HI16_SIGN(script_word) (SCR_HI16(script_word) & 0x8000 ? -1 : SCR_HI16(script_word))

#define LO8(half) (((half) & 0x00FF) >> 0)
#define HI8(half) (((half) & 0xFF00) >> 8)

bool TryMoveUnitDisplayed(struct EventProc * proc, struct Unit * unit, int x, int y, fu16 move_speed);
bool DisplayMovement(struct EventProc * proc, struct Unit * unit, u8 const * move_script, fu16 move_speed);
void Event_FadeOutOfBackgroundTalk(struct EventProc * proc);
void EventClearTalkDisplayed(struct EventProc * proc);
void Event_FadeOutOfSkip(struct EventProc * proc);
void EventForceSlowTextSpeed(struct EventProc * proc);
void EventTalkWait(struct EventProc * proc);
void func_0800AF20(struct EventProc * proc);

extern struct ProcScr ProcScr_MoveCamera[];
extern u8 gWorkingMoveScript[];

bool AiGetUnitClosestValidPosition(struct Unit * unit, fi16 x, fi16 y, struct Vec2i * out_position);
void UnitSyncMovement(struct Unit * unit);
void RefreshEntityMaps(void);

struct EventWaitForMuProc
{
    /* 00 */ PROC_HEADER;
    /* 29 */ STRUCT_PAD(0x29, 0x2C);
    /* 2C */ i32 x;
    /* 30 */ i32 y;
    /* 34 */ STRUCT_PAD(0x34, 0x54);
    /* 54 */ Proc * mu_proc;
};

extern struct ProcScr ProcScr_EventWaitForMu[];

void HideUnitSprite(struct Unit * unit);
Proc * StartMu(struct Unit * unit);
void DisableMuCamera(Proc * mu);
void SetMuMoveScript(Proc * mu, u8 const * move_script);
Proc * SpawnProc(struct ProcScr const * script, Proc * parent);
void func_0806D4CC(Proc * mu, int move_speed);

struct SpriteAnim;
struct MuConfig;

struct MuProc
{
    /* 00 */ PROC_HEADER;

    /* 2C */ struct Unit * unit;

    // TODO: this is all FE6 offsets. this probably changed

    /* 30 */ struct SpriteAnim * sprite_anim;
    /* 34 */ struct MuConfig * config;

    /* 38 */ u8 cam_b;
    /* 39 */ u8 state;
    /* 3A */ u8 hidden_b;
    /* 3B */ u8 jid;
    /* 3C */ i8 facing;
    /* 3D */ u8 step_sound_clock;
    /* 3E */ u8 fast_walk_b;
    /* 3F */ // pad
    /* 40 */ u16 move_clock_q4;
    /* 42 */ i16 move_config;
    /* 44 */ i16 x_q4, y_q4;
    /* 48 */ i16 x_offset_q4, y_offset_q4;
};

bool IsMuActive(Proc * mu);
void EndMu(Proc * mu);
void ShowUnitSprite(struct Unit * unit);
void Proc_Break(Proc * proc);

void EventUnitLoadWait(struct EventProc * proc);
void EventUnitLoadAliveWait(struct EventProc * proc);
void EventLoadUnitsAsParty(struct EventProc * proc);

void ForceSyncUnitSpriteSheet(void);
void EventMovementWait(struct EventProc * proc);
void LoadUnitWrapper(struct UnitInfo const * unit_info, Proc * parent);
void FakeLoadUnit(struct UnitInfo const * info, struct Unit * unit);

extern struct UnitInfo gMutableUnitInfo;
extern struct UnitInfo UnitInfo_Dummy;

#define EVENT_CMD_END 0x00
#define EVENT_CMD_LABEL 0x44

struct EventCmdInfo
{
    int (*func)(struct EventProc * proc);
    int size;
};

extern struct EventCmdInfo gEventCmdTable[];

int EventGiveItem(struct Unit * unit, fu16 iid, struct EventProc * proc);
void StartGiveItem(struct Unit * unit, fu16 iid, Proc * parent);

#include "m4a.h"

#define PlaySe(id)                                                                                                     \
    if (!gPlayStatus.config_se_disable)                                                                                \
    m4aSongNumStart((id))

void RenderMapForFade(void);
void ApplyMapChange(int id);
void RemoveMapChangeTrap(int id);
void AddMapChangeTrap(int id);
void RefreshTerrainMap(void);
void StartMapFade(bool lock_field);
void UpdateRoofedUnits(void);
void RefreshAutoWaterShadows(void);

int GetMapChangeIdAt(int x, int y);
void UnitChangeFaction(struct Unit * unit, int faction);

struct EventFlashCursorProc
{
    /* 00 */ PROC_HEADER;
    /* 29 */ STRUCT_PAD(0x29, 0x58);
    /* 58 */ i32 clock;
    /* 5C */ STRUCT_PAD(0x5C, 0x64);
    /* 64 */ i16 x;
    /* 66 */ i16 y;
};

extern struct ProcScr ProcScr_EventFlashCursor[];
void EventFlashCursorWait(struct EventProc * proc);

void Proc_EndEach(struct ProcScr const * script);

enum
{
    MAP_CURSOR_DEFAULT,
    MAP_CURSOR_REGULAR,
    MAP_CURSOR_RED_MOVING,
    MAP_CURSOR_STRETCHED,
    MAP_CURSOR_RED_STATIC,
};

void PutMapCursor(int x, int y, int kind);

extern struct ProcScr ProcScr_EventCursor[];

struct EventCursorProc
{
    /* 00 */ PROC_HEADER;
    /* 29 */ STRUCT_PAD(0x29, 0x64);
    /* 64 */ i16 x;
    /* 66 */ i16 y;
};

void ClearUnit(struct Unit * unit);

void SetAutoMuDefaultFacing(void);
void StartMuDeathFade(Proc * mu_proc);

void EventRemoveDisplayedWait(struct EventProc * proc);

void EndAllMus(void);

// = END OF GARBAGE =

u8 EWRAM_DATA gEventRememberedX[4] = { 0 };
u8 EWRAM_DATA gEventRememberedY[4] = { 0 };

int EvtCmd_Sleep(struct EventProc * proc)
{
    // script[1]: duration

    int duration = SCR_HI16(proc->script[0]);

    if ((proc->flags & EVENT_FLAG_SKIPPED) != 0)
        return EVENT_CMDRET_CONTINUE;

    if (duration > 0)
        duration--;

    proc->sleep_duration = duration;
    proc->unk_4E = 0;

    return EVENT_CMDRET_YIELD;
}

int EvtCmd_SleepFast(struct EventProc * proc)
{
    // script[1]: duration

    int duration = SCR_HI16(proc->script[0]);

    if ((proc->flags & EVENT_FLAG_SKIPPED) != 0)
        return EVENT_CMDRET_CONTINUE;

    if (duration > 0)
        duration--;

    proc->sleep_duration = duration;
    proc->unk_4E = 1;

